In [58]:
#PANDAS IS USE FOR DOING ANALYSIS ON A DATA SET....WORK WITH DATA FRAME......DATA FRAME AS A NATURE OF EXCEL SHEET
import numpy as np
data2 = {
    'Name':['janet','Ike','Samson','Adamu','Anslem','Eva'],
    'Company':['Dangote','Unilever','pfizer','UBA','Brains and Hammmers','Access'],
  
    'Sales': np.random.randint(10,50,6)
}

In [59]:
import pandas as pd

In [61]:
pd.DataFrame(data2)

     Name              Company  Sales
0   janet              Dangote     40
1     Ike             Unilever     22
2  Samson               pfizer     35
3   Adamu                  UBA     37
4  Anslem  Brains and Hammmers     27
5     Eva               Access     48

In [62]:
df = pd.DataFrame (data2) #to retrieve company

In [63]:
ser = df['Name']

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df

     Name              Company  Sales
0   janet              Dangote     40
1     Ike             Unilever     22
2  Samson               pfizer     35
3   Adamu                  UBA     37
4  Anslem  Brains and Hammmers     27
5     Eva               Access     48

In [66]:
df['Company']

0                Dangote
1               Unilever
2                 pfizer
3                    UBA
4    Brains and Hammmers
5                 Access
Name: Company, dtype: object

In [67]:
#to retrieve the first person info 
il = df.iloc[0]

In [73]:
il

Name         janet
Company    Dangote
Sales           40
Name: 0, dtype: object

In [94]:
import numpy as np

jp =pd.read_csv('npl.csv')

In [75]:
jp

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,10-Jun,234,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8,PG,26,3-Jun,203,Butler,2433333.0
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [76]:
jp

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,10-Jun,234,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8,PG,26,3-Jun,203,Butler,2433333.0
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [77]:
type(jp)

pandas.core.frame.DataFrame

In [86]:
jp['Name']

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
452       Trey Lyles
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
Name: Name, Length: 457, dtype: object

In [87]:
sala = jp['Salary']

In [80]:
sala

0      7730337.0
1      6796117.0
2            NaN
3      1148640.0
4      5000000.0
         ...
452    2239800.0
453    2433333.0
454     900000.0
455    2900000.0
456     947276.0
Name: Salary, Length: 457, dtype: float64

sum(sala)

In [81]:
sala.sum

<bound method Series.sum of 0      7730337.0
1      6796117.0
2            NaN
3      1148640.0
4      5000000.0
         ...
452    2239800.0
453    2433333.0
454     900000.0
455    2900000.0
456     947276.0
Name: Salary, Length: 457, dtype: float64>

In [82]:
max(sala)

25000000.0

In [83]:
np.sum(sala)

2159837111.0

In [97]:
np.mean(jp['Weight'])

221.52297592997812

['Weight']

In [4]:
imort pandas as pd

SyntaxError: invalid syntax (<ipython-input-4-94b4fbeca566>, line 1)